Solodros/ChibiOS-Contrib/os/hal/ports/AT32/AT32F403_7xx/at32_registry.h
#define AT32_HAS_TMR4                       TRUE
#define AT32_TMR4_IS_32BITS                 FALSE
#define AT32_TMR4_CHANNELS                  4

#define AT32_HAS_TMR5                       TRUE
#define AT32_TMR5_IS_32BITS                 TRUE
#define AT32_TMR5_CHANNELS                  4

#define AT32_HAS_TMR6                       TRUE
#define AT32_TMR6_IS_32BITS                 FALSE
#define AT32_TMR6_CHANNELS                  0

#define AT32_HAS_TMR7                       TRUE
#define AT32_TMR7_IS_32BITS                 FALSE
#define AT32_TMR7_CHANNELS                  0

#define AT32_HAS_TMR8                       TRUE
#define AT32_TMR8_IS_32BITS                 FALSE
#define AT32_TMR8_CHANNELS                  4

#define AT32_HAS_TMR9                       TRUE
#define AT32_TMR9_IS_32BITS                 FALSE
#define AT32_TMR9_CHANNELS                  2

#define AT32_HAS_TMR10                      TRUE
#define AT32_TMR10_IS_32BITS                FALSE
#define AT32_TMR10_CHANNELS                 1

#define AT32_HAS_TMR11                      TRUE
#define AT32_TMR11_IS_32BITS                FALSE
#define AT32_TMR11_CHANNELS                 1

#define AT32_HAS_TMR12                      TRUE
#define AT32_TMR12_IS_32BITS                FALSE
#define AT32_TMR12_CHANNELS                 2

#define AT32_HAS_TMR13                      TRUE
#define AT32_TMR13_IS_32BITS                FALSE
#define AT32_TMR13_CHANNELS                 1

#define AT32_HAS_TMR14                      TRUE
#define AT32_TMR14_IS_32BITS                FALSE
#define AT32_TMR14_CHANNELS                 1

/* USART attributes.*/
#define AT32_HAS_USART1                    TRUE
#define AT32_HAS_USART2                    TRUE
#define AT32_HAS_USART3                    TRUE
#define AT32_HAS_UART4                     TRUE
#define AT32_HAS_UART5                     TRUE
#define AT32_HAS_USART6                    FALSE
#define AT32_HAS_UART7                     TRUE
#define AT32_HAS_UART8                     FALSE

/* USB attributes.*/
#define AT32_HAS_USB                       TRUE
#define AT32_USB_ACCESS_SCHEME_2x16        FALSE
#define AT32_USB_PMA_MAX_SIZE              1280
#define AT32_USB_HAS_BCDR                  FALSE
#define AT32_USB_HAS_CFG                   TRUE

/* IWDG attributes.*/
#define AT32_HAS_IWDG                      TRUE
#define AT32_IWDG_IS_WINDOWED              TRUE

/* FSMC attributes.*/
#define AT32_HAS_XMC                       TRUE

/* CRC attributes.*/
#define AT32_HAS_CRC                       TRUE
#define AT32_CRC_PROGRAMMABLE              FALSE

#endif /* defined(AT32F403ACx) */

#if defined(AT32F403ARx) || defined(__DOXYGEN__)
/**
 * @name    AT32F403ARx capabilities
 * @{
 */
/* ADC attributes.*/
#define AT32_HAS_ADC1                       TRUE
#define AT32_ADC1_DMA_MSK                   (AT32_DMA_STREAM_ID_MSK(1, 1))
#define AT32_ADC1_DMA_CHN                   0x00000000
#define AT32_HAS_ADC2                       TRUE
#define AT32_ADC2_DMA_MSK                   (AT32_DMA_STREAM_ID_MSK(1, 1))
#define AT32_ADC2_DMA_CHN                   0x00000000
#define AT32_HAS_ADC3                       TRUE
#define AT32_ADC3_DMA_MSK                   (AT32_DMA_STREAM_ID_MSK(2, 5))
#define AT32_ADC3_DMA_CHN                   0x00000000

/* CAN attributes.*/
#define AT32_HAS_CAN1                       TRUE
#define AT32_HAS_CAN2                       TRUE
#define AT32_CAN_MAX_FILTERS                14

/* DAC attributes.*/
#define AT32_HAS_DAC1_CH1                   TRUE
#define AT32_HAS_DAC1_CH2                   TRUE

/* DMA attributes.*/
#define AT32_ADVANCED_DMA                   FALSE
#define AT32_DMA_SUPPORTS_DMAMUX            TRUE
#define AT32_DMA_SUPPORTS_CSELR             FALSE

#define AT32_DMA1_NUM_CHANNELS              7
#define AT32_DMA1_CH1_HANDLER               Vector6C
#define AT32_DMA1_CH2_HANDLER               Vector70
#define AT32_DMA1_CH3_HANDLER               Vector74
#define AT32_DMA1_CH4_HANDLER               Vector78
#define AT32_DMA1_CH5_HANDLER               Vector7C
#define AT32_DMA1_CH6_HANDLER               Vector80
#define AT32_DMA1_CH7_HANDLER               Vector84
#define AT32_DMA1_CH1_NUMBER                11
#define AT32_DMA1_CH2_NUMBER                12
#define AT32_DMA1_CH3_NUMBER                13
#define AT32_DMA1_CH4_NUMBER                14
#define AT32_DMA1_CH5_NUMBER                15
#define AT32_DMA1_CH6_NUMBER                16
#define AT32_DMA1_CH7_NUMBER                17

#define AT32_DMA2_NUM_CHANNELS              7
#define AT32_DMA2_CH1_HANDLER               Vector120
#define AT32_DMA2_CH2_HANDLER               Vector124
#define AT32_DMA2_CH3_HANDLER               Vector128
#define AT32_DMA2_CH45_HANDLER              Vector12C
#define AT32_DMA2_CH67_HANDLER              Vector16C

#define AT32_DMA2_CH1_NUMBER                56
#define AT32_DMA2_CH2_NUMBER                57
#define AT32_DMA2_CH3_NUMBER                58
#define AT32_DMA2_CH45_NUMBER               59
#define AT32_DMA2_CH67_NUMBER               75

#define AT32_DMA2_CH4_NUMBER                AT32_DMA2_CH45_NUMBER
#define AT32_DMA2_CH5_NUMBER                AT32_DMA2_CH45_NUMBER
#define AT32_DMA2_CH6_NUMBER                AT32_DMA2_CH67_NUMBER 
#define AT32_DMA2_CH7_NUMBER                AT32_DMA2_CH67_NUMBER 

#define DMA2_CH4_CMASK                      0x00000C00U
#define DMA2_CH5_CMASK                      0x00000C00U
#define DMA2_CH6_CMASK                      0x00003000U
#define DMA2_CH7_CMASK                      0x00003000U

/* ETH attributes.*/
#define AT32_HAS_ETH                        FALSE

/* EXTI attributes.*/
#define AT32_EXTI_NUM_LINES                 20
#define AT32_EXTI_IMR_MASK                  0x00000000U

/* Flash attributes.*/
#if defined(AT32F40xxG)
#define AT32_FLASH_NUMBER_OF_BANKS          2
#else
#define AT32_FLASH_NUMBER_OF_BANKS          1
#endif

#define AT32_FLASH_SECTOR_SIZE              2048U

#if !defined(AT32_FLASH_SECTORS_PER_BANK) || defined(__DOXYGEN__)
#if defined(AT32F40xxG) || defined(AT32F40xxE)
#define AT32_FLASH_SECTORS_PER_BANK         256 /* Maximum, can be redefined.*/
#elif 
#define AT32_FLASH_SECTORS_PER_BANK         128 /* Maximum, can be redefined.*/
#endif
#endif

/* GPIO attributes.*/
#define AT32_HAS_GPIOA                      TRUE
#define AT32_HAS_GPIOB                      TRUE
#define AT32_HAS_GPIOC                      TRUE
#define AT32_HAS_GPIOD                      TRUE
#define AT32_HAS_GPIOE                      FALSE
#define AT32_HAS_GPIOF                      FALSE
#define AT32_HAS_GPIOG                      FALSE
#define AT32_GPIO_HAS_HDRV                  TRUE

